#### Terraform Plan Result
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_backup_policy_vm.backup_policy will be created
  + resource "azurerm_backup_policy_vm" "backup_policy" {
      + id                             = (known after apply)
      + instant_restore_retention_days = (known after apply)
      + name                           = "corp-daily-backup"
      + policy_type                    = "V1"
      + recovery_vault_name            = "corp-rsv"
      + resource_group_name            = "corp-hubspoke-rg"
      + timezone                       = "UTC"

      + backup {
          + frequency = "Daily"
          + time      = "23:00"
        }

      + retention_daily {
          + count = 14
        }
    }

  # azurerm_backup_protected_vm.vm_backup will be created
  + resource "azurerm_backup_protected_vm" "vm_backup" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "corp-rsv"
      + resource_group_name = "corp-hubspoke-rg"
      + source_vm_id        = (known after apply)
    }

  # azurerm_bastion_host.bastion will be created
  + resource "azurerm_bastion_host" "bastion" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + kerberos_enabled       = false
      + location               = "uksouth"
      + name                   = "corp-bastion"
      + resource_group_name    = "corp-hubspoke-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_firewall.fw will be created
  + resource "azurerm_firewall" "fw" {
      + dns_proxy_enabled   = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "corp-firewall"
      + resource_group_name = "corp-hubspoke-rg"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Standard"
      + threat_intel_mode   = (known after apply)

      + ip_configuration {
          + name                 = "configuration"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_firewall_network_rule_collection.outbound_rules will be created
  + resource "azurerm_firewall_network_rule_collection" "outbound_rules" {
      + action              = "Allow"
      + azure_firewall_name = "corp-firewall"
      + id                  = (known after apply)
      + name                = "outbound-rules"
      + priority            = 100
      + resource_group_name = "corp-hubspoke-rg"

      + rule {
          + destination_addresses = [
              + "*",
            ]
          + destination_ports     = [
              + "53",
              + "80",
              + "443",
            ]
          + name                  = "allow-web-dns"
          + protocols             = [
              + "TCP",
              + "UDP",
            ]
          + source_addresses      = [
              + "10.1.0.0/16",
            ]
        }
    }

  # azurerm_network_interface.vm_nic will be created
  + resource "azurerm_network_interface" "vm_nic" {
      + accelerated_networking_enabled = (known after apply)
      + applied_dns_servers            = (known after apply)
      + dns_servers                    = (known after apply)
      + enable_accelerated_networking  = (known after apply)
      + enable_ip_forwarding           = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = (known after apply)
      + location                       = "uksouth"
      + mac_address                    = (known after apply)
      + name                           = "corp-win2022-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "corp-hubspoke-rg"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_public_ip.bastion_pip will be created
  + resource "azurerm_public_ip" "bastion_pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "corp-bastion-pip"
      + resource_group_name     = "corp-hubspoke-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_public_ip.fw_pip will be created
  + resource "azurerm_public_ip" "fw_pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "corp-fw-pip"
      + resource_group_name     = "corp-hubspoke-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_recovery_services_vault.rsv will be created
  + resource "azurerm_recovery_services_vault" "rsv" {
      + cross_region_restore_enabled  = false
      + id                            = (known after apply)
      + immutability                  = (known after apply)
      + location                      = "uksouth"
      + name                          = "corp-rsv"
      + public_network_access_enabled = true
      + resource_group_name           = "corp-hubspoke-rg"
      + sku                           = "Standard"
      + soft_delete_enabled           = true
      + storage_mode_type             = "GeoRedundant"
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "corp-hubspoke-rg"
    }

  # azurerm_route_table.spoke_rt will be created
  + resource "azurerm_route_table" "spoke_rt" {
      + bgp_route_propagation_enabled = (known after apply)
      + disable_bgp_route_propagation = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "corp-spoke-rt"
      + resource_group_name           = "corp-hubspoke-rg"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "route-to-firewall"
              + next_hop_in_ip_address = (known after apply)
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
    }

  # azurerm_subnet.bastion_subnet will be created
  + resource "azurerm_subnet" "bastion_subnet" {
      + address_prefixes                               = [
          + "10.0.2.0/26",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "corp-hubspoke-rg"
      + virtual_network_name                           = "corp-hub-vnet"
    }

  # azurerm_subnet.fw_subnet will be created
  + resource "azurerm_subnet" "fw_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/26",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallSubnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "corp-hubspoke-rg"
      + virtual_network_name                           = "corp-hub-vnet"
    }

  # azurerm_subnet.spoke_subnet will be created
  + resource "azurerm_subnet" "spoke_subnet" {
      + address_prefixes                               = [
          + "10.1.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "workload-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "corp-hubspoke-rg"
      + virtual_network_name                           = "corp-spoke-vnet"
    }

  # azurerm_subnet_route_table_association.spoke_rt_assoc will be created
  + resource "azurerm_subnet_route_table_association" "spoke_rt_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_virtual_network.hub_vnet will be created
  + resource "azurerm_virtual_network" "hub_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "corp-hub-vnet"
      + resource_group_name = "corp-hubspoke-rg"
      + subnet              = (known after apply)
    }

  # azurerm_virtual_network.spoke_vnet will be created
  + resource "azurerm_virtual_network" "spoke_vnet" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "corp-spoke-vnet"
      + resource_group_name = "corp-hubspoke-rg"
      + subnet              = (known after apply)
    }

  # azurerm_virtual_network_peering.hub_to_spoke will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "peer-hub-to-spoke"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "corp-hubspoke-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "corp-hub-vnet"
    }

  # azurerm_virtual_network_peering.spoke_to_hub will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "peer-spoke-to-hub"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "corp-hubspoke-rg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "corp-spoke-vnet"
    }

  # azurerm_windows_virtual_machine.vm will be created
  + resource "azurerm_windows_virtual_machine" "vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + enable_automatic_updates                               = true
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = false
      + id                                                     = (known after apply)
      + location                                               = "uksouth"
      + max_bid_price                                          = -1
      + name                                                   = "corp-winvm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByOS"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "corp-hubspoke-rg"
      + size                                                   = "Standard_D2s_v3"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # random_password.vm_password will be created
  + resource "random_password" "vm_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + firewall_private_ip = (known after apply)
  + vm_admin_password   = (sensitive value)
  + vm_private_ip       = (known after apply)
```
*Pushed by: @danilpremgi, Action: `pull_request`*
